Revit 2024 API
ElectricalSystem.HotConductorsNumber Property
 The HotConductors Number of the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public int HotConductorsNumber { get; }
Visual Basic
Public ReadOnly Property HotConductorsNumber As Integer
	Get
Visual C++
public:
property int HotConductorsNumber {
	int get ();
}
Remarks
 This property is used to retrieve the HotConductors Number of the Electrical System.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  This property only available when System Type is Power!
See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace